&НаКлиенте
Процедура ТоварыУслугиЦенаПриИзменении(Элемент)	
	СтрокаТЧ = Элементы.ТоварыУслуги.ТекущиеДанные;
	СтрокаТЧ.Всего = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыУслугиКоличествоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ТоварыУслуги.ТекущиеДанные;
	СтрокаТЧ.Всего = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыУслугиУслугиПриИзменении(Элемент)
	Элементы.ТоварыУслуги.ТекущиеДанные.Цена = ИзменениеЦены(Элементы.ТоварыУслуги.ТекущиеДанные.Услуга);
КонецПроцедуры

&НаСервере
Функция ИзменениеЦены(Услуга)

	Цена = Услуга.Цена;
	Возврат Цена;

КонецФункции // ИзменениеЦены()
