// склад теперь в табличной части, а не в шапке
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ОстаткиТовара.Очистить();
	Движения.ОстаткиТовара.Записывать = Истина;
	Движения.Записать();
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПродажаТовараСписокТоваров.Товар КАК Товар,
		|	ПродажаТовараСписокТоваров.Склад КАК Склад,
		|	СУММА(ПродажаТовараСписокТоваров.Количество) КАК Количество
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	Документ.ПродажаТовара.СписокТоваров КАК ПродажаТовараСписокТоваров
		|ГДЕ
		|	ПродажаТовараСписокТоваров.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажаТовараСписокТоваров.Товар,
		|	ПродажаТовараСписокТоваров.Склад
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Товар,
		|	Склад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт.Товар КАК Товар,
		|	вт.Склад КАК Склад,
		|	вт.Количество КАК Количество,
		|	ОстаткиТовараОстатки.КоличествоОстаток - вт.Количество КАК КоличествоОстаток,
		|	вт.Товар.Представление КАК ТоварПредставление,
		|	вт.Склад.Представление КАК СкладПредставление
		|ИЗ
		|	вт КАК вт
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТовара.Остатки(
		|				&МоментВремени,
		|				Склад В
		|						(ВЫБРАТЬ
		|							вт.Склад КАК Склад
		|						ИЗ
		|							вт КАК вт)
		|					И Товар В
		|						(ВЫБРАТЬ
		|							вт.Товар КАК Товар
		|						ИЗ
		|							вт КАК вт)) КАК ОстаткиТовараОстатки
		|		ПО вт.Товар = ОстаткиТовараОстатки.Товар
		|			И вт.Склад = ОстаткиТовараОстатки.Склад";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		//Дефицит = Выборка.Количество - Выборка.КоличествоОстаток;
		Если Выборка.КоличествоОстаток < 0 Тогда
		
			Отказ = Истина;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не хватает товаров " + Выборка.ТоварПредставление + " на складе " + Выборка.СкладПредставление + " в количестве " + -(Выборка.КоличествоОстаток);
			Сообщение.Сообщить();
		
		КонецЕсли;
		
		Если Отказ Тогда
		
			Продолжить;
		
		КонецЕсли;
		
		Движение = Движения.ОстаткиТовара.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Товар = Выборка.Товар;
		Движение.Склад = Выборка.Склад;
		Движение.Количество = Выборка.Количество;
	КонецЦикла;
	
	Движения.ОстаткиТовара.Записывать = Истина;
КонецПроцедуры
