Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ОстаткиТовара.Очистить();
	Движения.ОстаткиТовара.Записывать = Истина;
	Движения.Продажи.Записывать = Истина;
	Движения.Записать();
		
	Запрос2 = Новый Запрос;
	Запрос2.Текст = 
		"ВЫБРАТЬ
		|	ПродажаТовараСписокТоваров.Товар КАК Товар,
		|	СУММА(ПродажаТовараСписокТоваров.Количество) КАК Количество
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	Документ.ПродажаТовара.СписокТоваров КАК ПродажаТовараСписокТоваров
		|ГДЕ
		|	ПродажаТовараСписокТоваров.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажаТовараСписокТоваров.Товар
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Товар
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт.Товар КАК Товар,
		|	вт.Количество КАК Количество,
		|	ЕСТЬNULL(ОстаткиТовараОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	вт.Товар.Представление КАК ТоварПредставление
		|ИЗ
		|	вт КАК вт
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТовара.Остатки(
		|				&МоментВремени,
		|				Склад = &Склад
		|					И Товар В
		|						(ВЫБРАТЬ
		|							вт.Товар
		|						ИЗ
		|							вт КАК вт)) КАК ОстаткиТовараОстатки
		|		ПО вт.Товар = ОстаткиТовараОстатки.Товар";
	
	Запрос2.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос2.УстановитьПараметр("Склад", Склад);
	Запрос2.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос2.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Дефицит = Выборка.Количество - Выборка.КоличествоОстаток;
		Если Дефицит > 0 Тогда
		
			Отказ = Истина;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не хватает товара: " + Выборка.ТоварПредставление + " в количестве " + (-Выборка.КоличествоОстаток);
			Сообщение.Сообщить();;
		
		КонецЕсли;
		
		Если Отказ Тогда
		
			Продолжить;
		
		КонецЕсли;
		
		Движение = Движения.ОстаткиТовара.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Товар = Выборка.Товар;
		Движение.Количество = Выборка.Количество;
		
		
		Движение = Движения.Продажи.Добавить();        // так делать абсолютно нормально!!! по-другому записывать во второй регистр движения не получится
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Товар = Выборка.Товар;
		Движение.Количество = Выборка.Количество;
		
	КонецЦикла;
	
	Движения.ОстаткиТовара.Записать();
	Движения.Продажи.Записать();
	
КонецПроцедуры
