Процедура ОбработкаПроведения(Отказ, Режим) 
	
	//получене данных из документа и создание временной таблицы
    МВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПродажаТовараТовары.Товар КАК Товар,
		|	СУММА(ПродажаТовараТовары.Количество) КАК Количество
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	Документ.ПродажаТовара.Товары КАК ПродажаТовараТовары
		|ГДЕ
		|	ПродажаТовараТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажаТовараТовары.Товар
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Товар
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт.Товар,
		|	вт.Количество
		|ИЗ
		|	вт КАК вт";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	//формируем движение расходника
	Движения.ОстаткиТоваров.Очистить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Товары = Выборка.Товар;
		Движение.Количество = Выборка.Количество;
	КонецЦикла;

	//Запись в бд
	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.Записать();
	
	//запрос для получения отрицательных остатков

	//Запрос.МенеджерВременныхТаблиц = МВТ;	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = //я ебу что за фильтры тут нужно вставить??? 
		"ВЫБРАТЬ
		|	ОстаткиТоваровОстатки.Товары.Представление,
		|	ОстаткиТоваровОстатки.КоличествоОстаток
		|ИЗ
		|	вт КАК вт,
		|	РегистрНакопления.ОстаткиТоваров.Остатки(
		|			&МоментВремени,
		|			Товары В
		|				(ВЫБРАТЬ
		|					вт.Товар
		|				ИЗ
		|					вт КАК вт)) КАК ОстаткиТоваровОстатки
		|ГДЕ
		|	ОстаткиТоваровОстатки.КоличествоОстаток < 0";
	
	ГраницаКонтроля = Новый Граница(МоментВремени(), ВидГраницы.Включая);
	Запрос.УстановитьПараметр("МоментВремени", ГраницаКонтроля);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Отказ = Истина;
	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не хватает товара: " + ВыборкаДетальныеЗаписи.ТоварыПредставление + " в количестве " + (-ВыборкаДетальныеЗаписи.КоличествоОстаток);
			Сообщение.Сообщить();
		КонецЦикла;

	КонецЕсли;
	
КонецПроцедуры
