
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ОстаткиТовара.Очистить();
	Движения.ОстаткиТовара.Записывать = Истина;
	Движения.Записать();
	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПродажаТовараСписокТоваров.Товар КАК Товар,
		|	СУММА(ПродажаТовараСписокТоваров.Количество) КАК Количество
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	Документ.ПродажаТовара.СписокТоваров КАК ПродажаТовараСписокТоваров
		|ГДЕ
		|	ПродажаТовараСписокТоваров.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажаТовараСписокТоваров.Товар
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Товар
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт.Товар КАК Товар,
		|	вт.Количество КАК Количество,
		|	ЕСТЬNULL(ОстаткиТовараОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ОстаткиТовараОстатки.Товар.Представление КАК ТоварПредставление
		|ИЗ
		|	вт КАК вт
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТовара.Остатки(
		|				&МоментВремени,
		|				Товар В
		|					(ВЫБРАТЬ
		|						вт.Товар
		|					ИЗ
		|						вт КАК вт)) КАК ОстаткиТовараОстатки
		|		ПО вт.Товар = ОстаткиТовараОстатки.Товар";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Дефицит = Выборка.Количество - Выборка.КоличествоОстаток;
		Если Дефицит > 0 Тогда
		
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не хватает товара: " + Выборка.ТоварПредставление + " в количестве " + Дефицит;
			Сообщение.Сообщить();
		
		КонецЕсли;
		
		Если Отказ Тогда
		
			Продолжить;
		
		КонецЕсли;
		
		Движение = Движения.ОстаткиТовара.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Товар = Выборка.Товар;
		Движение.Количество = Выборка.Количество;
		
	КонецЦикла;
		
	Движения.ОстаткиТовара.Записывать = Истина;
	
КонецПроцедуры
