&НаКлиенте
Процедура ТоварыУслугиЦенаПриИзменении(Элемент)	
	СтрокаТЧ = Элементы.ТоварыУслуги.ТекущиеДанные;
	СтрокаТЧ.Всего = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыУслугиКоличествоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ТоварыУслуги.ТекущиеДанные;
	СтрокаТЧ.Всего = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыУслугиУслугиПриИзменении(Элемент)
	Элементы.ТоварыУслуги.ТекущиеДанные.Цена = ИзменениеЦены(Элементы.ТоварыУслуги.ТекущиеДанные.Услуга);
КонецПроцедуры

&НаСервере
Функция ИзменениеЦены(Услуга)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныУслугиСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныУслуги.СрезПоследних(&Дата, Услуги = &Услуга) КАК ЦеныУслугиСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("Услуга", Услуга);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
	
		Возврат 0;
		
	Иначе
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Возврат ВыборкаДетальныеЗаписи.Цена; 
		КонецЦикла;	
	
	КонецЕсли;
		
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецФункции // ИзменениеЦены()

&НаКлиенте
Процедура ТоварыУслугиВсегоПриИзменении(Элемент)
	Объект.Сумма = Объект.ТоварыУслуги.Итог("Сумма");
КонецПроцедуры
